In [1]:
import pandas
df = pandas.read_csv('full.csv')
df_schema = pandas.read_csv('schema.csv')

In [2]:
df

        YEAR MONTH  DAY  HOUR  ...  LATITUDE  LONGITUDE  DEPTH  MAGNITUDE
0       1964   FEB   24    23  ...   38.9000    23.9000     10        5.3
1       1964   APR   11    16  ...   39.7500    25.2500     10        5.7
2       1964   APR   21     8  ...   38.5000    22.2500     10        4.5
3       1964   APR   24     3  ...   38.0000    21.8000     10        5.0
4       1964   APR   29     4  ...   39.2500    23.7500     10        5.8
...      ...   ...  ...   ...  ...       ...        ...    ...        ...
313395  2021   APR    9     5  ...   39.7856    21.9081      5        0.6
313396  2021   APR    9     5  ...   39.7920    21.9328      5        1.5
313397  2021   APR    9     5  ...   39.7160    22.1947      8        1.0
313398  2021   APR    9     5  ...   39.7929    21.9154      6        1.0
313399  2021   APR    9     5  ...   39.8007    21.8948      7        1.2

[313400 rows x 10 columns]

In [3]:
df_schema

      COLUMN                   ATTRIBUTE
0       YEAR       event Date: Year XXXX
1      MONTH      event Date: Month abbr
2        DAY             event Date: Day
3       HOUR  event Time (GMT): Hour 24h
4     MINUTE    event Time (GMT): Minute
5     SECOND    event Time (GMT): Second
6   LATITUDE          event Latitude (N)
7  LONGITUDE         event Longitude (E)
8      DEPTH            event Depth (km)
9  MAGNITUDE          event Magnitude Mr

basic comparison, see quakes of 1983

In [4]:
df['YEAR'] == 1983

0         False
1         False
2         False
3         False
4         False
          ...
313395    False
313396    False
313397    False
313398    False
313399    False
Name: YEAR, Length: 313400, dtype: bool

this is a mask, every row false does not match the filter criteria, true the opposite

# FILTERS

In [5]:
filt = (df['YEAR'] == 1983)

apply our filter to our dataframe

In [6]:
df[filt]

       YEAR MONTH  DAY  HOUR  ...  LATITUDE  LONGITUDE  DEPTH  MAGNITUDE
11157  1983   JAN    2     1  ...     38.58      25.40     40        3.2
11158  1983   JAN    2     6  ...     37.32      20.56      5        4.3
11159  1983   JAN    3     0  ...     34.91      24.53     93        4.8
11160  1983   JAN    3    14  ...     36.05      21.75     10        3.7
11161  1983   JAN    4     3  ...     36.30      21.67     10        3.6
...     ...   ...  ...   ...  ...       ...        ...    ...        ...
12532  1983   DEC   28     8  ...     40.87      20.93      5        4.3
12533  1983   DEC   29     4  ...     37.26      20.86      5        3.5
12534  1983   DEC   29    10  ...     37.70      20.05      5        3.9
12535  1983   DEC   31     6  ...     35.34      26.40      5        4.1
12536  1983   DEC   31    14  ...     38.24      21.86     26        3.1

[1380 rows x 10 columns]

we can put comparisons directly in

In [9]:
df[df['YEAR'] == 1983]

       YEAR MONTH  DAY  HOUR  ...  LATITUDE  LONGITUDE  DEPTH  MAGNITUDE
11157  1983   JAN    2     1  ...     38.58      25.40     40        3.2
11158  1983   JAN    2     6  ...     37.32      20.56      5        4.3
11159  1983   JAN    3     0  ...     34.91      24.53     93        4.8
11160  1983   JAN    3    14  ...     36.05      21.75     10        3.7
11161  1983   JAN    4     3  ...     36.30      21.67     10        3.6
...     ...   ...  ...   ...  ...       ...        ...    ...        ...
12532  1983   DEC   28     8  ...     40.87      20.93      5        4.3
12533  1983   DEC   29     4  ...     37.26      20.86      5        3.5
12534  1983   DEC   29    10  ...     37.70      20.05      5        3.9
12535  1983   DEC   31     6  ...     35.34      26.40      5        4.1
12536  1983   DEC   31    14  ...     38.24      21.86     26        3.1

[1380 rows x 10 columns]

another way, with .loc

In [10]:
df.loc[filt]

       YEAR MONTH  DAY  HOUR  ...  LATITUDE  LONGITUDE  DEPTH  MAGNITUDE
11157  1983   JAN    2     1  ...     38.58      25.40     40        3.2
11158  1983   JAN    2     6  ...     37.32      20.56      5        4.3
11159  1983   JAN    3     0  ...     34.91      24.53     93        4.8
11160  1983   JAN    3    14  ...     36.05      21.75     10        3.7
11161  1983   JAN    4     3  ...     36.30      21.67     10        3.6
...     ...   ...  ...   ...  ...       ...        ...    ...        ...
12532  1983   DEC   28     8  ...     40.87      20.93      5        4.3
12533  1983   DEC   29     4  ...     37.26      20.86      5        3.5
12534  1983   DEC   29    10  ...     37.70      20.05      5        3.9
12535  1983   DEC   31     6  ...     35.34      26.40      5        4.1
12536  1983   DEC   31    14  ...     38.24      21.86     26        3.1

[1380 rows x 10 columns]

because we can still grab the columns

In [14]:
df.loc[(df['YEAR'] == 1983), ['YEAR', 'MAGNITUDE']]

       YEAR  MAGNITUDE
11157  1983        3.2
11158  1983        4.3
11159  1983        4.8
11160  1983        3.7
11161  1983        3.6
...     ...        ...
12532  1983        4.3
12533  1983        3.5
12534  1983        3.9
12535  1983        4.1
12536  1983        3.1

[1380 rows x 2 columns]

In [15]:
df.loc[filt, ['YEAR', 'MAGNITUDE']]

       YEAR  MAGNITUDE
11157  1983        3.2
11158  1983        4.3
11159  1983        4.8
11160  1983        3.7
11161  1983        3.6
...     ...        ...
12532  1983        4.3
12533  1983        3.5
12534  1983        3.9
12535  1983        4.1
12536  1983        3.1

[1380 rows x 2 columns]

In [19]:
filt = (df['YEAR'] == 1983) & (df['MAGNITUDE'] > 6.0)

In [20]:
df[filt]

       YEAR MONTH  DAY  HOUR  ...  LATITUDE  LONGITUDE  DEPTH  MAGNITUDE
11187  1983   JAN   17    12  ...     37.97      20.25      9        6.2
12112  1983   AUG    6    15  ...     40.08      24.81     22        6.6

[2 rows x 10 columns]

In [21]:
df.loc[filt]

       YEAR MONTH  DAY  HOUR  ...  LATITUDE  LONGITUDE  DEPTH  MAGNITUDE
11187  1983   JAN   17    12  ...     37.97      20.25      9        6.2
12112  1983   AUG    6    15  ...     40.08      24.81     22        6.6

[2 rows x 10 columns]

every quake happened in 1983 with magnitude more than 6, now show where they did happen

In [22]:
df.loc[filt, ['LATITUDE', 'LONGITUDE']]

       LATITUDE  LONGITUDE
11187     37.97      20.25
12112     40.08      24.81

display the years that an earthquake more than 6.0 magnitude occured

In [24]:
fltr = (df['MAGNITUDE'] > 6.0)
df.loc[fltr, 'YEAR']

13        1964
587       1967
656       1968
1276      1968
1434      1969
2978      1972
7279      1979
8566      1981
9798      1981
10059     1982
11187     1983
12112     1983
23470     1995
26896     1996
30005     1997
41186     2002
55505     2006
66776     2008
67244     2008
67271     2008
70357     2008
71499     2008
108086    2011
165455    2013
183047    2014
205228    2015
246613    2017
248511    2017
264559    2018
289059    2019
303157    2020
Name: YEAR, dtype: int64

where did they occure?

In [25]:
df.loc[fltr, ['YEAR', 'LATITUDE', 'LONGITUDE']]

        YEAR  LATITUDE  LONGITUDE
13      1964   39.7500    28.0000
587     1967   41.4000    20.5000
656     1968   39.5000    24.8000
1276    1968   36.6000    27.1000
1434    1969   38.6000    28.5000
2978    1972   35.3000    23.6000
7279    1979   42.0000    19.0000
8566    1981   38.1400    23.0000
9798    1981   39.2000    25.3000
10059   1982   39.9000    24.5000
11187   1983   37.9700    20.2500
12112   1983   40.0800    24.8100
23470   1995   40.1800    21.7100
26896   1996   36.1100    27.5200
30005   1997   37.2600    20.4900
41186   2002   35.5600    26.7300
55505   2006   36.2100    23.4100
66776   2008   37.1100    22.7800
67244   2008   36.5000    21.7800
67271   2008   36.2200    21.7500
70357   2008   37.9800    21.5100
71499   2008   35.8500    27.9200
108086  2011   35.6400    26.5600
165455  2013   35.5000    23.2800
183047  2014   40.2900    25.4000
205228  2015   35.2300    26.8200
246613  2017   38.8388    26.3623
248511  2017   36.9643    27.4332
264559  2018   37.3516    20.4922
289059  2019   35.6854    23.2599
303157  2020   37.9001    26.8167

but also after noon, so hour > 12

In [28]:
acceptable_hours = [lambda x: x in range(13,24)]

In [29]:
acceptable_hours

In [30]:
acceptable_hours = list(range(13,24))

In [31]:
acceptable_hours

[13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23]

In [32]:
df.loc[fltr, 'YEAR']

13        1964
587       1967
656       1968
1276      1968
1434      1969
2978      1972
7279      1979
8566      1981
9798      1981
10059     1982
11187     1983
12112     1983
23470     1995
26896     1996
30005     1997
41186     2002
55505     2006
66776     2008
67244     2008
67271     2008
70357     2008
71499     2008
108086    2011
165455    2013
183047    2014
205228    2015
246613    2017
248511    2017
264559    2018
289059    2019
303157    2020
Name: YEAR, dtype: int64

In [36]:
fltr2 = (df['MAGNITUDE'] > 6.0) & (df['HOUR'].isin(acceptable_hours))

In [39]:
df.loc[fltr2, 'YEAR']

13        1964
656       1968
2978      1972
8566      1981
9798      1981
10059     1982
12112     1983
30005     1997
108086    2011
165455    2013
205228    2015
248511    2017
264559    2018
Name: YEAR, dtype: int64

string methods for alterations or conditionals in dataframe

lets say we are looking for APR quakes

In [40]:
df[df['MONTH'] == 'APR']

        YEAR MONTH  DAY  HOUR  ...  LATITUDE  LONGITUDE  DEPTH  MAGNITUDE
1       1964   APR   11    16  ...   39.7500    25.2500     10        5.7
2       1964   APR   21     8  ...   38.5000    22.2500     10        4.5
3       1964   APR   24     3  ...   38.0000    21.8000     10        5.0
4       1964   APR   29     4  ...   39.2500    23.7500     10        5.8
5       1964   APR   29    17  ...   39.2500    23.7500     10        5.2
...      ...   ...  ...   ...  ...       ...        ...    ...        ...
313395  2021   APR    9     5  ...   39.7856    21.9081      5        0.6
313396  2021   APR    9     5  ...   39.7920    21.9328      5        1.5
313397  2021   APR    9     5  ...   39.7160    22.1947      8        1.0
313398  2021   APR    9     5  ...   39.7929    21.9154      6        1.0
313399  2021   APR    9     5  ...   39.8007    21.8948      7        1.2

[26833 rows x 10 columns]

In [44]:
df[df['MONTH'].str.contains('APR', na=False)]

        YEAR MONTH  DAY  HOUR  ...  LATITUDE  LONGITUDE  DEPTH  MAGNITUDE
1       1964   APR   11    16  ...   39.7500    25.2500     10        5.7
2       1964   APR   21     8  ...   38.5000    22.2500     10        4.5
3       1964   APR   24     3  ...   38.0000    21.8000     10        5.0
4       1964   APR   29     4  ...   39.2500    23.7500     10        5.8
5       1964   APR   29    17  ...   39.2500    23.7500     10        5.2
...      ...   ...  ...   ...  ...       ...        ...    ...        ...
313395  2021   APR    9     5  ...   39.7856    21.9081      5        0.6
313396  2021   APR    9     5  ...   39.7920    21.9328      5        1.5
313397  2021   APR    9     5  ...   39.7160    22.1947      8        1.0
313398  2021   APR    9     5  ...   39.7929    21.9154      6        1.0
313399  2021   APR    9     5  ...   39.8007    21.8948      7        1.2

[26833 rows x 10 columns]

again, remember about masking

In [45]:
fltr

0         False
1         False
2         False
3         False
4         False
          ...
313395    False
313396    False
313397    False
313398    False
313399    False
Name: MAGNITUDE, Length: 313400, dtype: bool

In [46]:
df['MONTH'].str.contains('APR')

0         False
1          True
2          True
3          True
4          True
          ...
313395     True
313396     True
313397     True
313398     True
313399     True
Name: MONTH, Length: 313400, dtype: bool